In [1]:
import pandas as pd

## Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Um index Ã© um rotulo para as linhas. 
index = ['Linha' + str(i) for i in range(5)]

In [8]:
s =pd.Series(data = data, index = index)

In [9]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [10]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [11]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [12]:
s = pd.Series(data)

## Data Frame

In [13]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [14]:
df1 = pd.DataFrame(data = data)

In [15]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
index = ['Linha' + str(i) for i in range(3)]

In [17]:
df1 = pd.DataFrame(data = data, index = index)

In [18]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [19]:
columns = ['Coluna' + str(i) for i in range(3)]

In [22]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [23]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [24]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [25]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [27]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [28]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [31]:
df1[df1 > 0] = 'A'
df2[df2 > 0] = 'B'
df2[df3 > 0] = 'C'

In [32]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C
Linha0       1       2       3
Linha1       4       5       6
Linha2       7       8       9

In [33]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0